###################################################################

# Created by write_sdc on Thu Jan 16 03:22:45 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {data_even_addr[9]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[8]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[7]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[6]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[5]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[4]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[3]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[2]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[1]}]
set_load -pin_load 3.40189 [get_ports {data_even_addr[0]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[9]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[8]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[7]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[6]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[5]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[4]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[3]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[2]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[1]}]
set_load -pin_load 3.40189 [get_ports {data_odd_addr[0]}]
create_clock [get_ports ck]  -name MY_CLK  -period 4  -waveform {0 2}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports sync_clr]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports en]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports inc_even]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports inc_odd]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_tilev[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_tilev[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_even_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_odd_addr[0]}]
