###################################################################

# Created by write_sdc on Thu Jan 16 03:26:40 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {o_data[63]}]
set_load -pin_load 3.40189 [get_ports {o_data[62]}]
set_load -pin_load 3.40189 [get_ports {o_data[61]}]
set_load -pin_load 3.40189 [get_ports {o_data[60]}]
set_load -pin_load 3.40189 [get_ports {o_data[59]}]
set_load -pin_load 3.40189 [get_ports {o_data[58]}]
set_load -pin_load 3.40189 [get_ports {o_data[57]}]
set_load -pin_load 3.40189 [get_ports {o_data[56]}]
set_load -pin_load 3.40189 [get_ports {o_data[55]}]
set_load -pin_load 3.40189 [get_ports {o_data[54]}]
set_load -pin_load 3.40189 [get_ports {o_data[53]}]
set_load -pin_load 3.40189 [get_ports {o_data[52]}]
set_load -pin_load 3.40189 [get_ports {o_data[51]}]
set_load -pin_load 3.40189 [get_ports {o_data[50]}]
set_load -pin_load 3.40189 [get_ports {o_data[49]}]
set_load -pin_load 3.40189 [get_ports {o_data[48]}]
set_load -pin_load 3.40189 [get_ports {o_data[47]}]
set_load -pin_load 3.40189 [get_ports {o_data[46]}]
set_load -pin_load 3.40189 [get_ports {o_data[45]}]
set_load -pin_load 3.40189 [get_ports {o_data[44]}]
set_load -pin_load 3.40189 [get_ports {o_data[43]}]
set_load -pin_load 3.40189 [get_ports {o_data[42]}]
set_load -pin_load 3.40189 [get_ports {o_data[41]}]
set_load -pin_load 3.40189 [get_ports {o_data[40]}]
set_load -pin_load 3.40189 [get_ports {o_data[39]}]
set_load -pin_load 3.40189 [get_ports {o_data[38]}]
set_load -pin_load 3.40189 [get_ports {o_data[37]}]
set_load -pin_load 3.40189 [get_ports {o_data[36]}]
set_load -pin_load 3.40189 [get_ports {o_data[35]}]
set_load -pin_load 3.40189 [get_ports {o_data[34]}]
set_load -pin_load 3.40189 [get_ports {o_data[33]}]
set_load -pin_load 3.40189 [get_ports {o_data[32]}]
set_load -pin_load 3.40189 [get_ports {o_data[31]}]
set_load -pin_load 3.40189 [get_ports {o_data[30]}]
set_load -pin_load 3.40189 [get_ports {o_data[29]}]
set_load -pin_load 3.40189 [get_ports {o_data[28]}]
set_load -pin_load 3.40189 [get_ports {o_data[27]}]
set_load -pin_load 3.40189 [get_ports {o_data[26]}]
set_load -pin_load 3.40189 [get_ports {o_data[25]}]
set_load -pin_load 3.40189 [get_ports {o_data[24]}]
set_load -pin_load 3.40189 [get_ports {o_data[23]}]
set_load -pin_load 3.40189 [get_ports {o_data[22]}]
set_load -pin_load 3.40189 [get_ports {o_data[21]}]
set_load -pin_load 3.40189 [get_ports {o_data[20]}]
set_load -pin_load 3.40189 [get_ports {o_data[19]}]
set_load -pin_load 3.40189 [get_ports {o_data[18]}]
set_load -pin_load 3.40189 [get_ports {o_data[17]}]
set_load -pin_load 3.40189 [get_ports {o_data[16]}]
set_load -pin_load 3.40189 [get_ports {o_data[15]}]
set_load -pin_load 3.40189 [get_ports {o_data[14]}]
set_load -pin_load 3.40189 [get_ports {o_data[13]}]
set_load -pin_load 3.40189 [get_ports {o_data[12]}]
set_load -pin_load 3.40189 [get_ports {o_data[11]}]
set_load -pin_load 3.40189 [get_ports {o_data[10]}]
set_load -pin_load 3.40189 [get_ports {o_data[9]}]
set_load -pin_load 3.40189 [get_ports {o_data[8]}]
set_load -pin_load 3.40189 [get_ports {o_data[7]}]
set_load -pin_load 3.40189 [get_ports {o_data[6]}]
set_load -pin_load 3.40189 [get_ports {o_data[5]}]
set_load -pin_load 3.40189 [get_ports {o_data[4]}]
set_load -pin_load 3.40189 [get_ports {o_data[3]}]
set_load -pin_load 3.40189 [get_ports {o_data[2]}]
set_load -pin_load 3.40189 [get_ports {o_data[1]}]
set_load -pin_load 3.40189 [get_ports {o_data[0]}]
create_clock [get_ports ck]  -name MY_CLK  -period 4  -waveform {0 2}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports en]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ldh_v_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports wr_pipe]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_ifmap_ptr[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_ifmap_ptr[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_ifmap_ptr[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_h[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_conv_v[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_acc[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[0]}]
