###################################################################

# Created by write_sdc on Fri Jan 31 20:03:05 2020

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports s_tc_hmode]
set_load -pin_load 3.40189 [get_ports s_tc_vmode]
set_load -pin_load 3.40189 [get_ports s_tc_res]
set_load -pin_load 3.40189 [get_ports s_tc_npu_ptr]
set_load -pin_load 3.40189 [get_ports s_tc_tilev]
set_load -pin_load 3.40189 [get_ports s_tc_tileh]
set_load -pin_load 3.40189 [get_ports s_tc_ifmaps]
set_load -pin_load 3.40189 [get_ports s_tc_ofmaps]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[8]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[7]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[6]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[5]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[4]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[3]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[2]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[1]}]
set_load -pin_load 3.40189 [get_ports {i_weight_addr[0]}]
set_load -pin_load 3.40189 [get_ports i_data_ev_odd_n]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[9]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[8]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[7]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[6]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[5]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[4]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[3]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[2]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[1]}]
set_load -pin_load 3.40189 [get_ports {i_data_even_addr[0]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[9]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[8]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[7]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[6]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[5]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[4]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[3]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[2]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[1]}]
set_load -pin_load 3.40189 [get_ports {i_data_odd_addr[0]}]
set_load -pin_load 3.40189 [get_ports o_data_ev_odd_n]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[9]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[8]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[7]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[6]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[5]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[4]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[3]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[2]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[1]}]
set_load -pin_load 3.40189 [get_ports {o_data_even_addr[0]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[9]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[8]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[7]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[6]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[5]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[4]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[3]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[2]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[1]}]
set_load -pin_load 3.40189 [get_ports {o_data_odd_addr[0]}]
set_load -pin_load 3.40189 [get_ports o_data_wr]
set_load -pin_load 3.40189 [get_ports o_data_wrh_l_n]
set_load -pin_load 3.40189 [get_ports {o_data[7]}]
set_load -pin_load 3.40189 [get_ports {o_data[6]}]
set_load -pin_load 3.40189 [get_ports {o_data[5]}]
set_load -pin_load 3.40189 [get_ports {o_data[4]}]
set_load -pin_load 3.40189 [get_ports {o_data[3]}]
set_load -pin_load 3.40189 [get_ports {o_data[2]}]
set_load -pin_load 3.40189 [get_ports {o_data[1]}]
set_load -pin_load 3.40189 [get_ports {o_data[0]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[15]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[14]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[13]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[12]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[11]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[10]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[9]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[8]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[7]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[6]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[5]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[4]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[3]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[2]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[1]}]
set_load -pin_load 3.40189 [get_ports {o_data_relu[0]}]
create_clock [get_ports ck]  -name MY_CLK  -period 4  -waveform {0 2}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_acth[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_actv[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ckg[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ckg[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ckg[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_k[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_k[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_k[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_i_tile[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_i_tile[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_o_tile[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_o_tile[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ifmaps[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ifmaps[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ifmaps[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ofmaps[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ofmaps[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ofmaps[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {arv_ofmaps[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_en_npu]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_ldh_v_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_en_hmode]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_en_vmode]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_wr_pipe]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_en_p]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports ctrl_wr_mem]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_hmode]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_vmode]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_res]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_npu_ptr]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_tilev]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_tileh]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_ifmaps]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports s_tc_ofmaps]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_weight_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports i_data_ev_odd_n]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_even_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {i_data_odd_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports o_data_ev_odd_n]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_even_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_odd_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports o_data_wr]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports o_data_wrh_l_n]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data_relu[0]}]
