###################################################################

# Created by write_sdc on Wed Apr 29 16:30:40 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_wire_load_model -name 5K_hvratio_1_1 -library NangateOpenCellLibrary
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[8]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[7]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[6]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[5]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[4]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[3]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[2]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[1]}]
set_load -pin_load 3.40189 [get_ports {fsm_flag_o[0]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[11]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[10]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[9]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[8]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[7]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[6]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[5]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[4]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[3]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[2]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[1]}]
set_load -pin_load 3.40189 [get_ports {dp_ptr_o[0]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[0]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[1]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[2]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[3]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[4]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[5]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[6]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_rmask_o[7]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[0]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[1]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[2]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[3]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[4]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[5]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[6]}]
set_load -pin_load 3.40189 [get_ports {dp_ckg_cmask_o[7]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[15]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[14]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[13]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[12]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[11]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[10]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[9]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[8]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[7]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[6]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[5]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[4]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[3]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[2]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[1]}]
set_load -pin_load 3.40189 [get_ports {addr_data_even_o[0]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[15]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[14]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[13]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[12]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[11]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[10]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[9]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[8]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[7]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[6]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[5]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[4]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[3]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[2]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[1]}]
set_load -pin_load 3.40189 [get_ports {addr_data_odd_o[0]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[15]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[14]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[13]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[12]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[11]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[10]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[9]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[8]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[7]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[6]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[5]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[4]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[3]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[2]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[1]}]
set_load -pin_load 3.40189 [get_ports {addr_weight_o[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 4  -waveform {0 2}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_MEM_RD_DATA_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_MEM_RD_WEIGHT_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_DP_EN_NPU_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_DP_LDH_V_N_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_DP_LDK_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_EN_CNT_KX_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_EN_CNT_KY_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_EN_CNT_RE_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fsm_cmd_i_UPDATE_IDX_]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_idx_mod_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_mac_mod_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {cfg_addr_stride_i[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {fsm_flag_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ptr_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_rmask_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {dp_ckg_cmask_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_even_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_data_odd_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {addr_weight_o[0]}]
