###################################################################

# Created by write_sdc on Wed Apr 29 16:29:09 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_wire_load_model -name 5K_hvratio_1_1 -library NangateOpenCellLibrary
set_load -pin_load 3.40189 [get_ports {data_o[31]}]
set_load -pin_load 3.40189 [get_ports {data_o[30]}]
set_load -pin_load 3.40189 [get_ports {data_o[29]}]
set_load -pin_load 3.40189 [get_ports {data_o[28]}]
set_load -pin_load 3.40189 [get_ports {data_o[27]}]
set_load -pin_load 3.40189 [get_ports {data_o[26]}]
set_load -pin_load 3.40189 [get_ports {data_o[25]}]
set_load -pin_load 3.40189 [get_ports {data_o[24]}]
set_load -pin_load 3.40189 [get_ports {data_o[23]}]
set_load -pin_load 3.40189 [get_ports {data_o[22]}]
set_load -pin_load 3.40189 [get_ports {data_o[21]}]
set_load -pin_load 3.40189 [get_ports {data_o[20]}]
set_load -pin_load 3.40189 [get_ports {data_o[19]}]
set_load -pin_load 3.40189 [get_ports {data_o[18]}]
set_load -pin_load 3.40189 [get_ports {data_o[17]}]
set_load -pin_load 3.40189 [get_ports {data_o[16]}]
set_load -pin_load 3.40189 [get_ports {data_o[15]}]
set_load -pin_load 3.40189 [get_ports {data_o[14]}]
set_load -pin_load 3.40189 [get_ports {data_o[13]}]
set_load -pin_load 3.40189 [get_ports {data_o[12]}]
set_load -pin_load 3.40189 [get_ports {data_o[11]}]
set_load -pin_load 3.40189 [get_ports {data_o[10]}]
set_load -pin_load 3.40189 [get_ports {data_o[9]}]
set_load -pin_load 3.40189 [get_ports {data_o[8]}]
set_load -pin_load 3.40189 [get_ports {data_o[7]}]
set_load -pin_load 3.40189 [get_ports {data_o[6]}]
set_load -pin_load 3.40189 [get_ports {data_o[5]}]
set_load -pin_load 3.40189 [get_ports {data_o[4]}]
set_load -pin_load 3.40189 [get_ports {data_o[3]}]
set_load -pin_load 3.40189 [get_ports {data_o[2]}]
set_load -pin_load 3.40189 [get_ports {data_o[1]}]
set_load -pin_load 3.40189 [get_ports {data_o[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 4  -waveform {0 2}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports fc_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports cmd_mem_rd_data_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports cmd_mem_rd_weight_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports cmd_en_npu_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports cmd_ldh_v_n_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports cmd_rd_pipe_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports cmd_en_p_2_2_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_wr_addr_h_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_wr_addr_h_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_wr_addr_h_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_addr_h_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_addr_h_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_addr_h_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_mux_h_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_mux_h_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_mux_h_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_mux_v_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_mux_v_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ptr_rd_mux_v_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[127]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[126]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[125]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[124]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[123]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[122]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[121]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[120]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[119]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[118]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[117]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[116]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[115]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[114]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[113]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[112]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[111]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[110]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[109]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[108]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[107]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[106]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[105]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[104]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[103]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[102]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[101]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[100]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[99]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[98]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[97]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[96]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[95]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[94]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[93]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[92]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[91]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[90]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[89]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[88]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[87]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[86]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[85]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[84]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[83]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[82]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[81]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[80]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[79]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[78]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[77]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[76]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[75]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[74]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[73]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[72]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[71]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[70]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[69]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[68]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[67]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[66]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[65]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[64]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {weight_fc_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_v_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_h_i[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_o[0]}]
