###################################################################

# Created by write_sdc on Tue Oct 22 00:16:41 2019

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {o_data1[43]}]
set_load -pin_load 3.40189 [get_ports {o_data1[42]}]
set_load -pin_load 3.40189 [get_ports {o_data1[41]}]
set_load -pin_load 3.40189 [get_ports {o_data1[40]}]
set_load -pin_load 3.40189 [get_ports {o_data1[39]}]
set_load -pin_load 3.40189 [get_ports {o_data1[38]}]
set_load -pin_load 3.40189 [get_ports {o_data1[37]}]
set_load -pin_load 3.40189 [get_ports {o_data1[36]}]
set_load -pin_load 3.40189 [get_ports {o_data1[35]}]
set_load -pin_load 3.40189 [get_ports {o_data1[34]}]
set_load -pin_load 3.40189 [get_ports {o_data1[33]}]
set_load -pin_load 3.40189 [get_ports {o_data1[32]}]
set_load -pin_load 3.40189 [get_ports {o_data1[31]}]
set_load -pin_load 3.40189 [get_ports {o_data1[30]}]
set_load -pin_load 3.40189 [get_ports {o_data1[29]}]
set_load -pin_load 3.40189 [get_ports {o_data1[28]}]
set_load -pin_load 3.40189 [get_ports {o_data1[27]}]
set_load -pin_load 3.40189 [get_ports {o_data1[26]}]
set_load -pin_load 3.40189 [get_ports {o_data1[25]}]
set_load -pin_load 3.40189 [get_ports {o_data1[24]}]
set_load -pin_load 3.40189 [get_ports {o_data1[23]}]
set_load -pin_load 3.40189 [get_ports {o_data1[22]}]
set_load -pin_load 3.40189 [get_ports {o_data1[21]}]
set_load -pin_load 3.40189 [get_ports {o_data1[20]}]
set_load -pin_load 3.40189 [get_ports {o_data1[19]}]
set_load -pin_load 3.40189 [get_ports {o_data1[18]}]
set_load -pin_load 3.40189 [get_ports {o_data1[17]}]
set_load -pin_load 3.40189 [get_ports {o_data1[16]}]
set_load -pin_load 3.40189 [get_ports {o_data1[15]}]
set_load -pin_load 3.40189 [get_ports {o_data1[14]}]
set_load -pin_load 3.40189 [get_ports {o_data1[13]}]
set_load -pin_load 3.40189 [get_ports {o_data1[12]}]
set_load -pin_load 3.40189 [get_ports {o_data1[11]}]
set_load -pin_load 3.40189 [get_ports {o_data1[10]}]
set_load -pin_load 3.40189 [get_ports {o_data1[9]}]
set_load -pin_load 3.40189 [get_ports {o_data1[8]}]
set_load -pin_load 3.40189 [get_ports {o_data1[7]}]
set_load -pin_load 3.40189 [get_ports {o_data1[6]}]
set_load -pin_load 3.40189 [get_ports {o_data1[5]}]
set_load -pin_load 3.40189 [get_ports {o_data1[4]}]
set_load -pin_load 3.40189 [get_ports {o_data1[3]}]
set_load -pin_load 3.40189 [get_ports {o_data1[2]}]
set_load -pin_load 3.40189 [get_ports {o_data1[1]}]
set_load -pin_load 3.40189 [get_ports {o_data1[0]}]
set_load -pin_load 3.40189 [get_ports {o_data2[43]}]
set_load -pin_load 3.40189 [get_ports {o_data2[42]}]
set_load -pin_load 3.40189 [get_ports {o_data2[41]}]
set_load -pin_load 3.40189 [get_ports {o_data2[40]}]
set_load -pin_load 3.40189 [get_ports {o_data2[39]}]
set_load -pin_load 3.40189 [get_ports {o_data2[38]}]
set_load -pin_load 3.40189 [get_ports {o_data2[37]}]
set_load -pin_load 3.40189 [get_ports {o_data2[36]}]
set_load -pin_load 3.40189 [get_ports {o_data2[35]}]
set_load -pin_load 3.40189 [get_ports {o_data2[34]}]
set_load -pin_load 3.40189 [get_ports {o_data2[33]}]
set_load -pin_load 3.40189 [get_ports {o_data2[32]}]
set_load -pin_load 3.40189 [get_ports {o_data2[31]}]
set_load -pin_load 3.40189 [get_ports {o_data2[30]}]
set_load -pin_load 3.40189 [get_ports {o_data2[29]}]
set_load -pin_load 3.40189 [get_ports {o_data2[28]}]
set_load -pin_load 3.40189 [get_ports {o_data2[27]}]
set_load -pin_load 3.40189 [get_ports {o_data2[26]}]
set_load -pin_load 3.40189 [get_ports {o_data2[25]}]
set_load -pin_load 3.40189 [get_ports {o_data2[24]}]
set_load -pin_load 3.40189 [get_ports {o_data2[23]}]
set_load -pin_load 3.40189 [get_ports {o_data2[22]}]
set_load -pin_load 3.40189 [get_ports {o_data2[21]}]
set_load -pin_load 3.40189 [get_ports {o_data2[20]}]
set_load -pin_load 3.40189 [get_ports {o_data2[19]}]
set_load -pin_load 3.40189 [get_ports {o_data2[18]}]
set_load -pin_load 3.40189 [get_ports {o_data2[17]}]
set_load -pin_load 3.40189 [get_ports {o_data2[16]}]
set_load -pin_load 3.40189 [get_ports {o_data2[15]}]
set_load -pin_load 3.40189 [get_ports {o_data2[14]}]
set_load -pin_load 3.40189 [get_ports {o_data2[13]}]
set_load -pin_load 3.40189 [get_ports {o_data2[12]}]
set_load -pin_load 3.40189 [get_ports {o_data2[11]}]
set_load -pin_load 3.40189 [get_ports {o_data2[10]}]
set_load -pin_load 3.40189 [get_ports {o_data2[9]}]
set_load -pin_load 3.40189 [get_ports {o_data2[8]}]
set_load -pin_load 3.40189 [get_ports {o_data2[7]}]
set_load -pin_load 3.40189 [get_ports {o_data2[6]}]
set_load -pin_load 3.40189 [get_ports {o_data2[5]}]
set_load -pin_load 3.40189 [get_ports {o_data2[4]}]
set_load -pin_load 3.40189 [get_ports {o_data2[3]}]
set_load -pin_load 3.40189 [get_ports {o_data2[2]}]
set_load -pin_load 3.40189 [get_ports {o_data2[1]}]
set_load -pin_load 3.40189 [get_ports {o_data2[0]}]
set_load -pin_load 3.40189 [get_ports {o_data3[43]}]
set_load -pin_load 3.40189 [get_ports {o_data3[42]}]
set_load -pin_load 3.40189 [get_ports {o_data3[41]}]
set_load -pin_load 3.40189 [get_ports {o_data3[40]}]
set_load -pin_load 3.40189 [get_ports {o_data3[39]}]
set_load -pin_load 3.40189 [get_ports {o_data3[38]}]
set_load -pin_load 3.40189 [get_ports {o_data3[37]}]
set_load -pin_load 3.40189 [get_ports {o_data3[36]}]
set_load -pin_load 3.40189 [get_ports {o_data3[35]}]
set_load -pin_load 3.40189 [get_ports {o_data3[34]}]
set_load -pin_load 3.40189 [get_ports {o_data3[33]}]
set_load -pin_load 3.40189 [get_ports {o_data3[32]}]
set_load -pin_load 3.40189 [get_ports {o_data3[31]}]
set_load -pin_load 3.40189 [get_ports {o_data3[30]}]
set_load -pin_load 3.40189 [get_ports {o_data3[29]}]
set_load -pin_load 3.40189 [get_ports {o_data3[28]}]
set_load -pin_load 3.40189 [get_ports {o_data3[27]}]
set_load -pin_load 3.40189 [get_ports {o_data3[26]}]
set_load -pin_load 3.40189 [get_ports {o_data3[25]}]
set_load -pin_load 3.40189 [get_ports {o_data3[24]}]
set_load -pin_load 3.40189 [get_ports {o_data3[23]}]
set_load -pin_load 3.40189 [get_ports {o_data3[22]}]
set_load -pin_load 3.40189 [get_ports {o_data3[21]}]
set_load -pin_load 3.40189 [get_ports {o_data3[20]}]
set_load -pin_load 3.40189 [get_ports {o_data3[19]}]
set_load -pin_load 3.40189 [get_ports {o_data3[18]}]
set_load -pin_load 3.40189 [get_ports {o_data3[17]}]
set_load -pin_load 3.40189 [get_ports {o_data3[16]}]
set_load -pin_load 3.40189 [get_ports {o_data3[15]}]
set_load -pin_load 3.40189 [get_ports {o_data3[14]}]
set_load -pin_load 3.40189 [get_ports {o_data3[13]}]
set_load -pin_load 3.40189 [get_ports {o_data3[12]}]
set_load -pin_load 3.40189 [get_ports {o_data3[11]}]
set_load -pin_load 3.40189 [get_ports {o_data3[10]}]
set_load -pin_load 3.40189 [get_ports {o_data3[9]}]
set_load -pin_load 3.40189 [get_ports {o_data3[8]}]
set_load -pin_load 3.40189 [get_ports {o_data3[7]}]
set_load -pin_load 3.40189 [get_ports {o_data3[6]}]
set_load -pin_load 3.40189 [get_ports {o_data3[5]}]
set_load -pin_load 3.40189 [get_ports {o_data3[4]}]
set_load -pin_load 3.40189 [get_ports {o_data3[3]}]
set_load -pin_load 3.40189 [get_ports {o_data3[2]}]
set_load -pin_load 3.40189 [get_ports {o_data3[1]}]
set_load -pin_load 3.40189 [get_ports {o_data3[0]}]
set_load -pin_load 3.40189 [get_ports {o_data4[43]}]
set_load -pin_load 3.40189 [get_ports {o_data4[42]}]
set_load -pin_load 3.40189 [get_ports {o_data4[41]}]
set_load -pin_load 3.40189 [get_ports {o_data4[40]}]
set_load -pin_load 3.40189 [get_ports {o_data4[39]}]
set_load -pin_load 3.40189 [get_ports {o_data4[38]}]
set_load -pin_load 3.40189 [get_ports {o_data4[37]}]
set_load -pin_load 3.40189 [get_ports {o_data4[36]}]
set_load -pin_load 3.40189 [get_ports {o_data4[35]}]
set_load -pin_load 3.40189 [get_ports {o_data4[34]}]
set_load -pin_load 3.40189 [get_ports {o_data4[33]}]
set_load -pin_load 3.40189 [get_ports {o_data4[32]}]
set_load -pin_load 3.40189 [get_ports {o_data4[31]}]
set_load -pin_load 3.40189 [get_ports {o_data4[30]}]
set_load -pin_load 3.40189 [get_ports {o_data4[29]}]
set_load -pin_load 3.40189 [get_ports {o_data4[28]}]
set_load -pin_load 3.40189 [get_ports {o_data4[27]}]
set_load -pin_load 3.40189 [get_ports {o_data4[26]}]
set_load -pin_load 3.40189 [get_ports {o_data4[25]}]
set_load -pin_load 3.40189 [get_ports {o_data4[24]}]
set_load -pin_load 3.40189 [get_ports {o_data4[23]}]
set_load -pin_load 3.40189 [get_ports {o_data4[22]}]
set_load -pin_load 3.40189 [get_ports {o_data4[21]}]
set_load -pin_load 3.40189 [get_ports {o_data4[20]}]
set_load -pin_load 3.40189 [get_ports {o_data4[19]}]
set_load -pin_load 3.40189 [get_ports {o_data4[18]}]
set_load -pin_load 3.40189 [get_ports {o_data4[17]}]
set_load -pin_load 3.40189 [get_ports {o_data4[16]}]
set_load -pin_load 3.40189 [get_ports {o_data4[15]}]
set_load -pin_load 3.40189 [get_ports {o_data4[14]}]
set_load -pin_load 3.40189 [get_ports {o_data4[13]}]
set_load -pin_load 3.40189 [get_ports {o_data4[12]}]
set_load -pin_load 3.40189 [get_ports {o_data4[11]}]
set_load -pin_load 3.40189 [get_ports {o_data4[10]}]
set_load -pin_load 3.40189 [get_ports {o_data4[9]}]
set_load -pin_load 3.40189 [get_ports {o_data4[8]}]
set_load -pin_load 3.40189 [get_ports {o_data4[7]}]
set_load -pin_load 3.40189 [get_ports {o_data4[6]}]
set_load -pin_load 3.40189 [get_ports {o_data4[5]}]
set_load -pin_load 3.40189 [get_ports {o_data4[4]}]
set_load -pin_load 3.40189 [get_ports {o_data4[3]}]
set_load -pin_load 3.40189 [get_ports {o_data4[2]}]
set_load -pin_load 3.40189 [get_ports {o_data4[1]}]
set_load -pin_load 3.40189 [get_ports {o_data4[0]}]
set_load -pin_load 3.40189 [get_ports tc]
create_clock [get_ports clk]  -name MY_CLK  -period 10  -waveform {0 5}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst_fsm]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports start]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_rmask[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {ckg_cmask[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {layer_fc[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {layer_fc[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel2[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel3[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_kernel4[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {i_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data1[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data2[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data3[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {o_data4[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports tc]
